jsphuebner/esp8266-web-interface/src/arm_debug.cpp
    return true;
}

int ARMDebug::flashWait()
{
	//Programming error flags. Cleared by writing this value into FLASH_CR
	const uint32_t FLASH_SR_ERROR_FLAGS = 0xF0;
	const uint32_t FLASH_SR_BUSY = 1<<16;
    const uint32_t FLASH_SR_WRPRTERR = 2<<16;

    uint32_t timeout = 10000;
    uint32_t start = millis();
    uint32_t status;

    for (;;)
	{
		apRead(REG_FPEC_FLASH_SR, status);
		if (!(status & FLASH_SR_BUSY))
			break;
        //if (status & FLASH_SR_WRPRTERR)
        //    return -2;
		if (millis()-start > timeout)
		{
			Serial.printf("Flash Wait Timeout %08x\n",status);
			return -1;
		}
	}
	if (status & FLASH_SR_ERROR_FLAGS)
	{
		// clear the errors
		apWrite(REG_FPEC_FLASH_SR, status & ~FLASH_SR_ERROR_FLAGS);
	}

    return 0;
}

bool ARMDebug::flashEraseAll()
{
	flashWait();

    unlockFlash();

    uint32_t flashcr = 0x00000000;
    
    if (apRead(REG_FPEC_FLASH_CR, flashcr))
    {
        Serial.printf("FLASH_CR Before %08x\n",flashcr);

        flashcr &= ~FLASH_CR_PG;    // ensure PG bit low
        flashcr &= ~FLASH_CR_PER;   // ensure PER is low
        flashcr |=  FLASH_CR_MER;   // set MER bit
        flashcr |=  FLASH_CR_STRT;  // set STRT bit

        Serial.printf("FLASH_CR After %08x\n",flashcr);

        //apWrite(REG_FPEC_FLASH_CR, flashcr);
        memStore(REG_FPEC_FLASH_CR, flashcr);

        flashWait();

        return true;
    }
    
    //apWrite(REG_FPEC_FLASH_CR, 0x00000044);
    //apWrite(REG_FPEC_FLASH_CR, FLASH_CR_PER | FLASH_CR_STRT | FLASH_CR_SNB(0));

    flashWait();

    return false;
}

bool ARMDebug::flashProtectionCheck()
{
	flashWait();

    unlockFlash();

    //TODO: Get info from the Option byte register (FLASH_OBR)

	uint32_t rdp;
	if (apRead(REG_FPEC_FLASH_WRPR, rdp))
    {
   		Serial.printf("RDP Status %08x\n", rdp);
   	}
   	return false;
}

bool ARMDebug::flashProtectionUnlock()
{
	//When the read protection option byte is altered to a memory-unprotect value, a mass erase is performed.

	flashWait();

    unlockFlash();

	apWrite(REG_FPEC_FLASH_CR, FLASH_CR_OPTWRE | FLASH_CR_STRT);
	apWrite(REG_FPEC_FLASH_WRPR, REG_FPEC_KEY_RDPRT); ///???

	flashWait();
}

bool ARMDebug::flashErase(uint32_t addr)
{
	flashWait();

    unlockFlash();

    uint32_t flashcr;

    if (apRead(REG_FPEC_FLASH_CR, flashcr))
    {
        apWrite(REG_FPEC_FLASH_CR, flashcr &= ~0);  // ensure PG bit low
        apWrite(REG_FPEC_FLASH_CR, flashcr &= ~2);  // ensure MER is low
        apWrite(REG_FPEC_FLASH_CR, flashcr |= 1);   // set PER bit
        apWrite(REG_FPEC_FLASH_AR, addr);
        apWrite(REG_FPEC_FLASH_CR, flashcr |= 6);   // set STRT bit

        flashWait();
        return true;
    }

    return false;
}

bool ARMDebug::flashWrite(uint32_t addr, uint32_t data)
{
	flashWait();

    unlockFlash();

    uint32_t flashcr;
    if (apRead(REG_FPEC_FLASH_CR, flashcr))
    {
        apWrite(REG_FPEC_FLASH_CR, flashcr &= ~1);  // ensure PER is low
        apWrite(REG_FPEC_FLASH_CR, flashcr &= ~2);  // ensure MER is low
        apWrite(REG_FPEC_FLASH_CR, flashcr |= 0);   // set PG bit

        //Perform the data write (half-word) at the desired address
        memStoreHalf(addr, data >> 16);
        memStoreHalf(addr + 4, data & 0x0000FFFF);

        flashWait();
    }else{
    	return false;
    }

	return true;
}

bool ARMDebug::regTransactionHandshake()
{
    const uint32_t S_REGRDY = 1<<16;
    uint32_t dhcsr;
    if (!memLoad(REG_SCB_DHCSR, dhcsr)) {
        // Lower-level communications error
        return false;
    }
    return (dhcsr & S_REGRDY) != 0;
}

bool ARMDebug::regWrite(unsigned num, uint32_t data)
{
    const uint32_t write = 0x10000;
    num &= 0xFFFF;
    return memStore(REG_SCB_DCRDR, data)
        && memStore(REG_SCB_DCRSR, num | write)
        && regTransactionHandshake();
}

bool ARMDebug::regRead(unsigned num, uint32_t& data)
{
    num &= 0xFFFF;
    return memStore(REG_SCB_DCRSR, num)
        && regTransactionHandshake()
        && memLoad(REG_SCB_DCRDR, data);
}

bool ARMDebug::memWriteCSW(uint32_t data)
{
    // Write to the MEM-AP CSW. Duplicate writes are ignored, and the cache is updated.

    if (data == cache.csw)
        return true;

    if (!apWrite(MEM_CSW, data | CSW_DEFAULTS))
        return false;

    cache.csw = data;
    return true;
}

bool ARMDebug::memWait()
{
    // Wait for a transaction to complete & the port to be enabled.

    uint32_t csw;
    if (!apReadPoll(MEM_CSW, csw, CSW_TRIN_PROG | CSW_DEVICE_EN, CSW_DEVICE_EN)) {
        log(LOG_ERROR, "ARMDebug: Error while waiting for memory port");
        return false;
    }

    return true;
}

bool ARMDebug::memStore(uint32_t addr, uint32_t data)
{
    return memStore(addr, &data, 1);
}

bool ARMDebug::memLoad(uint32_t addr, uint32_t &data)
{
    return memLoad(addr, &data, 1);
}

bool ARMDebug::memStoreAndVerify(uint32_t addr, uint32_t data)
{
    return memStoreAndVerify(addr, &data, 1);
}

bool ARMDebug::memStoreAndVerify(uint32_t addr, const uint32_t *data, unsigned count)
{
    if (!memStore(addr, data, count))
        return false;

    if (!memWait())
        return false;
    if (!apWrite(MEM_TAR, addr))
        return false;

    while (count) {
        uint32_t readback;

        if (!memWait())
            return false;
        if (!apRead(MEM_DRW, readback))
            return false;

        log(readback == *data ? LOG_TRACE_MEM : LOG_ERROR,
            "MEM Verif [%08x] %08x (expected %08x)", addr, readback, *data);

        if (readback != *data)
            return false;

        data++;
        addr++;
        count--;
    }

    return true;
}

bool ARMDebug::memStore(uint32_t addr, const uint32_t *data, unsigned count)
{
    if (!memWait())
        return false;
    if (!memWriteCSW(CSW_32BIT | CSW_ADDRINC_SINGLE))
        return false;
    if (!apWrite(MEM_TAR, addr))
        return false;

    while (count) {
        log(LOG_TRACE_MEM, "MEM Store [%08x] %08x", addr, *data);

        if (!memWait())
            return false;
        if (!apWrite(MEM_DRW, *data))
            return false;

        data++;
        addr++;
        count--;
    }

