jsphuebner/esp8266-web-interface/src/arm_debug.cpp
    va_list ap;
    LogLevel oldLogLevel;
    setLogLevel(LOG_NONE, oldLogLevel); //force log level none

    uint8_t byte;
    memLoadByte(addr, byte);

    *buffer = byte;
    
    setLogLevel(oldLogLevel); //restore previous log level
}

void ARMDebug::hexDump(uint32_t addr, unsigned count, StreamString &data)
{
    // Hex dump target memory to StreamString

    va_list ap;
    char buffer[32];
    LogLevel oldLogLevel;
    setLogLevel(LOG_NONE, oldLogLevel); //force log level none

    while (count) {
        snprintf(buffer, sizeof buffer, "%08x:", addr);
        data.print(buffer);

        for (unsigned x = 0; count && x < 4; x++) {
            uint32_t word;
            if (memLoad(addr, word)) {

                /*
                word = ((word << 8) & 0xFF00FF00) | ((word >> 8) & 0xFF00FF); 
                word = (word << 16) | ((word >> 16) & 0xFFFF);
                snprintf(buffer, sizeof buffer, " %08x", word);
                */

                uint8_t bytes[3];
                bytes[0] = (word >> 0)  & 0xFF;
                bytes[1] = (word >> 8)  & 0xFF;
                bytes[2] = (word >> 16) & 0xFF;
                bytes[3] = (word >> 24) & 0xFF;
                //snprintf(buffer, sizeof buffer, " | %02x %02x %02x %02x", bytes[3], bytes[2], bytes[1], bytes[0]); // big-endian
                snprintf(buffer, sizeof buffer, " | %02x %02x %02x %02x", bytes[0], bytes[1], bytes[2], bytes[3]); // little-endian (reversed)

                data.print(buffer);
            } else {
                data.print(" (error )");
            }

            count--;
            addr += 4; //int32 word = 4 individual bytes
        }

        data.println();
    }
    setLogLevel(oldLogLevel); //restore previous log level
}

void ARMDebug::setLogLevel(LogLevel newLevel)
{
    logLevel = newLevel;
}

void ARMDebug::setLogLevel(LogLevel newLevel, LogLevel &prevLevel)
{
    prevLevel = logLevel;
    logLevel = newLevel;
}
